Documents/Рекламации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Рекламации</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВедущийКонструктор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комплект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Конструктор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОстановитьПроизводство</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредыдущаяСтатдияПроизводства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Причина</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныРекламации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РКДВыполнено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/КанбанКолонки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КанбанКолонки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВРаботе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДействиеПриПопадании</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Доска</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗапрещенИнтерактивныйПереход</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗапрещенИнтерактивныйУход</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяСобытия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛимитКарточек</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛимитЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерПоПорядку</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Окончание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗадач</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребуетсяКомментарий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цвет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КанбанПереходКарточки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КанбанПереходКарточки</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НомерВКолонке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Окончание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УИДКудаДорожка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УИДКудаКолонка</Name>
					<Comment>"1"  выполнена. "100"  корзина "200" приостановлена.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УИДПерехода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УИДКарточка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КанбанКарточки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КанбанКарточки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Доска</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Окончание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ресурс</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цвет</Name>
					<Comment>ПустаяСтрока по умолчанию</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыРекламации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыРекламации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ИзОжиданияГЧ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзПроизводства</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/СтадииКомплекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>СтадииКомплекта</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВыводитьВторойУровеньВНаименовании</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьПервыйУровеньВНаименовании</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьТретийУровеньВНаименовании</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьЧетвертыйУровеньВНаименовании</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыврдитьЧетвертыйВместоТретьего</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Доработка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПоПорядку</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОграниченныйПоказ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ожидание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойЭтап</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОсновныеЭтапы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименованиеВРучную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитыСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонНаименования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РеквизитыСтадии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыЗадач</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЗадачи</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыЗадачКонструирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Состояние</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СостоянияЗадач</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/Рекламации/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	омЗаполнениеРеквизиов.ЗаполнитьРеквизитыСтандартные(Объект);
	
	Если ЗначениеЗаполнено(Объект.Проект) Тогда
		Элементы.Проект.СписокВыбора.Добавить(Объект.Проект);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Комплект) Тогда
		Элементы.Комплект.СписокВыбора.Добавить(Объект.Комплект);
	КонецЕсли;

	ТолькоПросмотр = Объект.РКДВыполнено;
	
	Если ПустаяСтрока(Объект.ПредыдущаяСтатдияПроизводства) Тогда
		Элементы.ПредыдущаяСтадия.Видимость = Ложь;
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	СтадииКомплектаРеквизитыСтадии.Ссылка.ПолноеНаименование КАК ПолноеНаименование
			|ИЗ
			|	РегистрСведений.КанбанКолонки КАК КанбанКолонки
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СтадииКомплекта.РеквизитыСтадии КАК СтадииКомплектаРеквизитыСтадии
			|		ПО КанбанКолонки.Статус = СтадииКомплектаРеквизитыСтадии.Статус
			|ГДЕ
			|	КанбанКолонки.УИД = &УИД";
		
		Запрос.УстановитьПараметр("УИД", Объект.ПредыдущаяСтатдияПроизводства);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ПредыдущаяСтадия = Выборка.ПолноеНаименование;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроектНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	Элементы.Проект.СписокВыбора.Очистить();
	
	Если ЗначениеЗаполнено(Объект.ТипРекламации) Тогда
		
		Для каждого ЗначениеПроекта Из ПолучитьСписокПроектовВПроизводстве(Объект.ТипРекламации) Цикл
			Элементы.Проект.СписокВыбора.Добавить(ЗначениеПроекта.Значение, ЗначениеПроекта.Представление);
		КонецЦикла;
		
		
	Иначе
		
		//	
		//	Если ЗначениеЗаполнено(Объект.Проект) Тогда
		//		Элементы.Проект.СписокВыбора.Добавить(Объект.Проект);
		//	КонецЕсли;
		//	
		//	СтандартнаяОбработка = Ложь;
		//	
		//	Сообщение = Новый СообщениеПользователю;
		//	Сообщение.Текст = "Не заполнен тип рекламации";
		//	Сообщение.Поле = "Объект.ТипРекламации";
		//	Сообщение.Сообщить();
		//	
		
		Для каждого ЗначениеПроекта Из ПолучитьСписокПроектовВПроизводстве(ПредопределенноеЗначение("Перечисление.ТипыРекламации.ИзОжиданияГЧ")) Цикл
			Элементы.Проект.СписокВыбора.Добавить(ЗначениеПроекта.Значение, ЗначениеПроекта.Представление);
		КонецЦикла;
		
		Для каждого ЗначениеПроекта Из ПолучитьСписокПроектовВПроизводстве(ПредопределенноеЗначение("Перечисление.ТипыРекламации.ИзПроизводства")) Цикл
			Если Элементы.Проект.СписокВыбора.НайтиПоЗначению(ЗначениеПроекта.Значение) = Неопределено Тогда
				Элементы.Проект.СписокВыбора.Добавить(ЗначениеПроекта.Значение, ЗначениеПроекта.Представление);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли; 
	
    Элементы.Проект.СписокВыбора.СортироватьПоПредставлению();
	
	Если Элементы.Проект.СписокВыбора.НайтиПоЗначению(Объект.Проект) = Неопределено Тогда
		Объект.Проект = ПредопределенноеЗначение("Справочник.Проекты.ПустаяСсылка");	
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокПроектовВПроизводстве(ТипРекламации)
	
	СписокВозврата = Новый СписокЗначений;
	Запрос = Новый Запрос;
	
	Если ТипРекламации = Перечисления.ТипыРекламации.ИзПроизводства Тогда
		
		Запрос.Текст = 
		
			"ВЫБРАТЬ
				|	ВЫРАЗИТЬ(КанбанКарточки.Ресурс КАК Справочник.ИзделияКомплект) КАК Комплект
				|ПОМЕСТИТЬ втКомплекты
				|ИЗ
				|	РегистрСведений.КанбанПереходКарточки.СрезПоследних КАК КанбанПереходКарточкиСрезПоследних
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КанбанКарточки КАК КанбанКарточки
				|		ПО КанбанПереходКарточкиСрезПоследних.УИДКарточка = КанбанКарточки.УИД
				|ГДЕ
				|	КанбанПереходКарточкиСрезПоследних.УИДКудаКолонка В(&УИДКудаКолонка)
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	втКомплекты.Комплект.Проект КАК Проект,
				|	втКомплекты.Комплект.Проект.Наименование КАК ПроектНаименование,
				|	втКомплекты.Комплект.Проект.Префикс КАК ПроектПрефикс,
				|	втКомплекты.Комплект.Проект.Номер КАК ПроектНомер
				|ИЗ
				|	втКомплекты КАК втКомплекты
				|
				|УПОРЯДОЧИТЬ ПО
				|	ПроектНомер";
				
		Запрос.УстановитьПараметр("УИДКудаКолонка", омКанбанПроизводство.ПолучитьУИДКолонокПороизводства());
		
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			СписокВозврата.Добавить(Выборка.Проект, Формат(Выборка.ПроектНомер, "ЧГ=0") + "-" + Выборка.ПроектНаименование + " (" + Выборка.ПроектПрефикс + ")");
		КонецЦикла;
		
	Иначе 	
		
		Для каждого х Из  Обработки.ОжиданиеГЧ.ЗадачиВОжиданииГЧ() Цикл
			
			Если СписокВозврата.НайтиПоЗначению(х.Проект) = Неопределено Тогда
				СписокВозврата.Добавить(х.Проект, Формат(х.ПроектНомер, "ЧГ=0") + "-" + х.ПроектНаименование + " (" + х.ПроектПрефикс + ")");
			КонецЕсли;
		КонецЦикла;
		
		СписокВозврата.СортироватьПоПредставлению();
		
	КонецЕсли;
	
	Возврат СписокВозврата;
	
КонецФункции // ПолучитьСписокПроектовВПроизводстве()

&НаКлиенте
Процедура ПроектПриИзменении(Элемент)
	Объект.Комплект = ПредопределенноеЗначение("Справочник.ИзделияКомплект.ПустаяСсылка");
	Элементы.ПоказыватьЗавершенноеПроизводство.Доступность = ЗначениеЗаполнено(Объект.Проект);
	ПоказыватьЗавершенноеПроизводство = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура КомплектНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	Элементы.Комплект.СписокВыбора.Очистить();
	
	Если ЗначениеЗаполнено(Объект.ТипРекламации) Тогда
		
		Для каждого ЗначениеКомплекта Из ПолучитьСписокКомплектовВПроизводстве(Объект.Проект, Объект.ТипРекламации, ПоказыватьЗавершенноеПроизводство) Цикл
			Элементы.Комплект.СписокВыбора.Добавить(ЗначениеКомплекта.Значение, ЗначениеКомплекта.Представление);
		КонецЦикла;
		
		Если Элементы.Комплект.СписокВыбора.НайтиПоЗначению(Объект.Комплект) = Неопределено Тогда
			Объект.Комплект = ПредопределенноеЗначение("Справочник.ИзделияКомплект.ПустаяСсылка");	
		КонецЕсли;
		
	Иначе
		
		Для каждого ЗначениеКомплекта Из ПолучитьСписокКомплектовВПроизводстве(Объект.Проект, ПредопределенноеЗначение("Перечисление.ТипыРекламации.ИзОжиданияГЧ"), ПоказыватьЗавершенноеПроизводство) Цикл
			Элементы.Проект.СписокВыбора.Добавить(ЗначениеКомплекта.Значение, ЗначениеКомплекта.Представление);
		КонецЦикла;
		
		Для каждого ЗначениеКомплекта Из ПолучитьСписокКомплектовВПроизводстве(Объект.Проект, ПредопределенноеЗначение("Перечисление.ТипыРекламации.ИзПроизводства"), ПоказыватьЗавершенноеПроизводство) Цикл
			Если Элементы.Комплект.СписокВыбора.НайтиПоЗначению(ЗначениеКомплекта.Значение) = Неопределено Тогда
				Элементы.Комплект.СписокВыбора.Добавить(ЗначениеКомплекта.Значение, ЗначениеКомплекта.Представление);
			КонецЕсли;
		КонецЦикла;
		
		//Если ЗначениеЗаполнено(Объект.Комплект) Тогда
		//	Элементы.Комплект.СписокВыбора.Добавить(Объект.Комплект);
		//КонецЕсли;
		//
		//СтандартнаяОбработка = Ложь;
		//
		//Сообщение = Новый СообщениеПользователю;
		//Сообщение.Текст = "Не заполнен тип рекламации";
		//Сообщение.Поле = "Объект.ТипРекламации";
		//Сообщение.Сообщить();
		//
	КонецЕсли;
	
	Элементы.Комплект.СписокВыбора.СортироватьПоПредставлению();
	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокКомплектовВПроизводстве(Проект, ТипРекламации, ДобавитьСлужебныеКолонки = Ложь)
	
	Возврат Документы.Рекламации.ПолучитьСписокКомплектовВПроизводстве(Проект, ТипРекламации, ДобавитьСлужебныеКолонки);
	
КонецФункции // ПолучитьСписокПроектовВПроизводстве()    

&НаКлиенте
Процедура КомплектПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Комплект) Тогда
		
		ЗаполнитьДанныеНаОснованииКомплекта();	
		
	КонецЕсли;
	
КонецПроцедуры

Процедура  ЗаполнитьДанныеНаОснованииКомплекта()

	Документы.Рекламации.ЗаполнитьДанныеНаОснованииКомплекта(Объект, Элементы, ПоказыватьЗавершенноеПроизводство);	

КонецПроцедуры //  ЗаполнитьДанныеНаОснованииКомплекта(Объект)


Функция ПолучитьПроект(Комплект)

	Возврат Комплект.Проект;	

КонецФункции // ПлдучтьПроект(Комплект)

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	УИДДоскиПроизводство = омКанбанДоскиНаСервереПовтор.ПолучитьУИДДоски("УИДДоскиПроизводство");
	
	ДанныеКарточки = омКанбанДоскиНаСервере.ПолучитьКарточкиКанбанаСКолонкамиИТегами(УИДДоскиПроизводство, ТекущийОбъект.Комплект);
	
	Если ДанныеКарточки.Количество() = 0 Тогда
		УИДКудаКолонка 	= "";
		УИДКарточка 	= "";
	Иначе
		УИДКудаКолонка 	= ДанныеКарточки[0].УИДКудаКолонка;
		УИДКарточка		= ДанныеКарточки[0].УИДКарточка;	
	КонецЕсли;
	
	Если Не ПустаяСтрока(УИДКарточка) Тогда
		
		УИДКолонкиПриостановки = омКанбанДоскиНаСервереПовтор.ПолучитьУИДКолонки(УИДДоскиПроизводство, "_Приостановка_Производства");
		
		Если УИДКолонкиПриостановки = УИДКудаКолонка Тогда
			
			Если (НЕ ТекущийОбъект.ОстановитьПроизводство ИЛИ ТекущийОбъект.РКДВыполнено) И НЕ ПустаяСтрока(ТекущийОбъект.ПредыдущаяСтатдияПроизводства) Тогда
				
				ТекущийОбъект.ПредыдущаяСтатдияПроизводства	= "";	
				
			КонецЕсли; 
			
		Иначе
			
			Если ТекущийОбъект.ОстановитьПроизводство И НЕ ТекущийОбъект.РКДВыполнено Тогда
				
				ТекущийОбъект.ПредыдущаяСтатдияПроизводства	= УИДКудаКолонка;	
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Запись Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипРекламацииНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ПоляДляОчистки 		= "";
	НаименованиеПоле 	= "очищено поле";
	
	Если ЗначениеЗаполнено(Объект.Комплект) Тогда
		ПоляДляОчистки = "комплект";	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Проект) Тогда
		
		Если ПустаяСтрока(ПоляДляОчистки) Тогда
			ПоляДляОчистки = "проект";	
		Иначе
			ПоляДляОчистки 		= "проект и " + ПоляДляОчистки;
			НаименованиеПоле 	= "очищены поля"
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Комплект) Тогда
		
		СтандартнаяОбработка = Ложь;
		ТестВопроса = СтрШаблон("При смене типа рекламации будет %1 %2. Продолжить?", НаименованиеПоле, ПоляДляОчистки);
		Оповещение = Новый ОписаниеОповещения("ПослеВопросаОСменеТипаРекламации", ЭтаФорма);
		ПоказатьВопрос(Оповещение, ТестВопроса, РежимДиалогаВопрос.ДаНет, , , "Очистка поля");	
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОСменеТипаРекламации(Результат, ДополнительныеСвойства) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Объект.Комплект = ПредопределенноеЗначение("Справочник.ИзделияКомплект.ПустаяСсылка");	
		Объект.Проект 	= ПредопределенноеЗначение("Справочник.Проекты.ПустаяСсылка");	
	КонецЕсли;	
	
КонецПроцедуры // СтандартнаяОбработка()


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(Объект.Проект) И Элементы.Проект.СписокВыбора.НайтиПоЗначению(Объект.Проект) = Неопределено Тогда
		Элементы.Проект.СписокВыбора.Добавить(Объект.Проект);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Комплект) И Элементы.Комплект.СписокВыбора.НайтиПоЗначению(Объект.Комплект) = Неопределено Тогда
		Элементы.Комплект.СписокВыбора.Добавить(Объект.Комплект);
	КонецЕсли;
КонецПроцедуры
